# Data Cleaning and Preparation

## Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark','artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

 Table 7-1. NA handling methods
 Argument         Description
 dropna           Filter axis labels based on whether values for each label have missing data, with varying thresholds for how 
                  much missing data to tolerate.
 fillna           Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.
 isnull           Return boolean values indicating which values are missing/NA.
 notnull          Negation of isnull.

## Filtering Out Missing Data

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.]])

In [13]:
cleaned = data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))

In [27]:
df.iloc[:4, 1] = NA

In [30]:
df.iloc[:2, 2] = NA

In [31]:
df

          0         1         2
0  2.000003       NaN       NaN
1  1.626859       NaN       NaN
2 -0.517642       NaN -2.143289
3 -0.451121       NaN -1.065174
4 -0.250930 -1.125506  0.911537
5  3.015468 -0.527753  0.264115
6 -1.491394  0.651447  1.177363

In [32]:
df.dropna()

          0         1         2
4 -0.250930 -1.125506  0.911537
5  3.015468 -0.527753  0.264115
6 -1.491394  0.651447  1.177363

In [33]:
df.dropna(thresh=2)

          0         1         2
2 -0.517642       NaN -2.143289
3 -0.451121       NaN -1.065174
4 -0.250930 -1.125506  0.911537
5  3.015468 -0.527753  0.264115
6 -1.491394  0.651447  1.177363

## Filing In Missing Data

In [34]:
df.fillna(0)

          0         1         2
0  2.000003  0.000000  0.000000
1  1.626859  0.000000  0.000000
2 -0.517642  0.000000 -2.143289
3 -0.451121  0.000000 -1.065174
4 -0.250930 -1.125506  0.911537
5  3.015468 -0.527753  0.264115
6 -1.491394  0.651447  1.177363

In [35]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  2.000003  0.500000  0.000000
1  1.626859  0.500000  0.000000
2 -0.517642  0.500000 -2.143289
3 -0.451121  0.500000 -1.065174
4 -0.250930 -1.125506  0.911537
5  3.015468 -0.527753  0.264115
6 -1.491394  0.651447  1.177363

In [40]:
_ = df.fillna(0, inplace =True)

In [41]:
df

          0         1         2
0  2.000003  0.000000  0.000000
1  1.626859  0.000000  0.000000
2 -0.517642  0.000000 -2.143289
3 -0.451121  0.000000 -1.065174
4 -0.250930 -1.125506  0.911537
5  3.015468 -0.527753  0.264115
6 -1.491394  0.651447  1.177363

In [42]:
df = pd.DataFrame(np.random.randn(6, 3))

In [43]:
df.iloc[2:, 1] =NA

In [44]:
df.iloc[4: ,2] =NA

In [45]:
df

          0         1         2
0 -0.153989 -2.858764 -1.634095
1  1.183848 -1.288556 -0.172700
2  1.016241       NaN  0.701282
3 -1.008200       NaN -1.055317
4  1.301706       NaN       NaN
5  0.665527       NaN       NaN

In [46]:
df.fillna(method='ffill')

C:\Users\Hemant\AppData\Local\Temp\ipykernel_13044\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0 -0.153989 -2.858764 -1.634095
1  1.183848 -1.288556 -0.172700
2  1.016241 -1.288556  0.701282
3 -1.008200 -1.288556 -1.055317
4  1.301706 -1.288556 -1.055317
5  0.665527 -1.288556 -1.055317

In [47]:
df.fillna(method='ffill', limit=2)

C:\Users\Hemant\AppData\Local\Temp\ipykernel_13044\2719175769.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.153989 -2.858764 -1.634095
1  1.183848 -1.288556 -0.172700
2  1.016241 -1.288556  0.701282
3 -1.008200 -1.288556 -1.055317
4  1.301706       NaN -1.055317
5  0.665527       NaN -1.055317

In [48]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [49]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Table 7-2. fillna function arguments
Argument           Description
 value             Scalar value or dict-like object to use to fill missing values
 method            Interpolation; by default 'ffill' if function called with no other arguments
 axis              Axis to fill on; default axis=0
 inplace           Modify the calling object without producing a copy
 limit             For forward and backward filling, maximum number of consecutive periods to fill

## Data Transformation

## Removing Duplicates

In [51]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 
'k2': [1, 1, 2, 3, 3, 4, 4]})

In [52]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [53]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [54]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [57]:
data['v1'] = range(7)

In [59]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [60]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data USing a Function or Maping

In [61]:
 data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami','honey ham',' nova lox'],
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [62]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [63]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
 }

In [64]:
lowercased = data['food'].str.lower()

In [65]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [66]:
data['animal'] = lowercased.map(meat_to_animal)

In [67]:
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     Pastrami     6.0    cow
4  corned beef     7.5    cow
5        Bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8     nova lox     6.0    NaN